---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionType.GetFamilySymbolId
source: html/33ed961b-ba63-84c8-4cea-499ad8c2efc3.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionType.GetFamilySymbolId Method

FamilySymbol of the annotation to use for this connection type.

## Syntax (C#)
```csharp
public ElementId GetFamilySymbolId()
```